+ TCP的滑动窗口是以字节为单位的
+ 发送方根据接收方发送的确认报文段中的窗口字段与确认号字段构造出字节的发送窗口 
  + 发送方的发送窗口大小不能超过接收方发送的确认报文段中的窗口字段规定的接收方的接收窗口大小
  + 发送方的发送窗口大小还要收到当时网络拥塞程度的制约
+ 发送窗口表示，在没有收到接收方的确认的情况下，发送方可以连续的把窗口内的数据都发出去，不过发送过的数据，在未收到确认之前都必须暂时保留，以便在超时重传时使用
+ 发送窗口的位置由前沿和后沿共同决定
  + 前沿的前面部分表示不允许发送的数据，接收方没有为这些数据保留临时存放的缓存空间
  + 后延的后面部分表示已发送并收到确认的数据
  + 后延的变化情况有两种
    + 不动（没有收到新的确认）
    + 前移（收到了新的确认）
    + 不可能向后移动
  + 前沿的变化情况有三种
    + 通常是不断向前移动（收到了新的确认）
    + 不动（没有收到新的确认，对方通知的窗口大小也不变）（收到了新的确认，但对方通知的窗口大小缩小了，使得前沿恰好不动）
    + 向后收缩（对方通知的窗口大小缩小了）强烈不建议这样做，因为很可能发送方收到这个通知以前已经发送了窗口中的许多数据，现在收缩窗口，不让发送，可能会产生错误
  + 
